const weapon_stats = {
  冲锋枪: {
    "RE-45": {
      战术: {
        切枪: 0.69,
        战术弹换时间: 2.06,
      },
      移速: {
        腰射移速: 0.87,
        举镜移速: 0.87,
      },
    },
    "双持P2020（空投）": {
      战术: {
        切枪: 0.85,
        空仓换弹时间: 2.08,
      },
      移速: {
        腰射移速: 0.87,
        举镜移速: 0.87,
      },
    },
    "R-99": {
      战术: {
        切枪: 0.53,
        空仓换弹时间: 1.96,
      },
      移速: {
        腰射移速: 0.87,
        举镜移速: 0.652,
      },
    },
    "C.A.R冲锋枪": {
      战术: {
        切枪: 0.56,
        空仓换弹时间: 2.13,
      },
      移速: {
        腰射移速: 0.87,
        举镜移速: 0.652,
      },
    },
    猎兽冲锋枪: {
      战术: {
        切枪: 0.56,
        空仓换弹时间: 2.3,
      },
      移速: {
        腰射移速: 0.87,
        举镜移速: 0.652,
      },
    },
    转换者冲锋枪: {
      战术: {
        切枪: 0.58,
        空仓换弹时间: 2.0,
      },
      移速: {
        腰射移速: 0.87,
        举镜移速: 0.652,
      },
    },
    电能冲锋枪默认: {
      战术: {
        切枪: 0.78,
        空仓换弹时间: 2.25,
      },
      移速: {
        腰射移速: 0.87,
        举镜移速: 0.652,
      },
    },
    电能冲锋枪彩弹: {
      战术: {
        切枪: 0.65,
        空仓换弹时间: 1.8,
      },
      移速: {
        腰射移速: 0.87,
        举镜移速: 0.652,
      },
    },
  },
  霰弹枪: {
    "双持/单持 莫桑比克": {
      战术: {
        切枪: 0.58,
        空仓换弹时间: 2.6,
      },
      移速: {
        腰射移速: 0.87,
        举镜移速: 0.87,
      },
    },
    "EVA-8默认": {
      战术: {
        切枪: 0.66,
        空仓换弹时间: 2.78,
      },
      移速: {
        腰射移速: 0.87,
        举镜移速: 0.782,
      },
    },
    "EVA-8彩弹": {
      战术: {
        切枪: 0.57,
        空仓换弹时间: 2.23,
      },
      移速: {
        腰射移速: 0.87,
        举镜移速: 0.782,
      },
    },
    獒犬: {
      战术: {
        切枪: 0.68,
        空仓换弹时间: 3.0,
      },
      移速: {
        腰射移速: 0.87,
        举镜移速: 0.782,
      },
    },
    和平捍卫者: {
      战术: {
        切枪: 0.68,
        空仓换弹时间: 3.31,
      },
      移速: {
        腰射移速: 0.87,
        举镜移速: 0.782,
      },
    },
  },
  步枪: {
    "R-301": {
      战术: {
        切枪: 0.65,
        空仓换弹时间: 3.2,
      },
      移速: {
        腰射移速: 0.87,
        举镜移速: 0.435,
      },
    },
    平行步枪: {
      战术: {
        切枪: 0.65,
        空仓换弹时间: 3.1,
      },
      移速: {
        腰射移速: 0.87,
        举镜移速: 0.435,
      },
    },
    赫姆洛克: {
      战术: {
        切枪: 0.73,
        空仓换弹时间: 2.85,
      },
      移速: {
        腰射移速: 0.87,
        举镜移速: 0.435,
      },
    },
    哈沃克: {
      战术: {
        切枪: 0.81,
        空仓换弹时间: 3.2,
      },
      移速: {
        腰射移速: 0.87,
        举镜移速: 0.435,
      },
    },
    复仇女神: {
      战术: {
        切枪: 0.93,
        空仓换弹时间: 3.0,
      },
      移速: {
        腰射移速: 0.87,
        举镜移速: 0.435,
      },
    },
  },
  机枪: {
    专注轻机枪: {
      战术: {
        切枪: 0.76,
        空仓换弹时间: 3.16,
      },
      移速: {
        腰射移速: 0.87,
        举镜移速: 0.348,
      },
    },
    暴走轻机枪: {
      战术: {
        切枪: 0.76,
        空仓换弹时间: 4.0,
      },
      移速: {
        腰射移速: 0.87,
        举镜移速: 0.348,
      },
    },
    "L-star": {
      战术: {
        切枪: 0.85,
        空仓换弹时间: 3.6,
      },
      移速: {
        腰射移速: 0.87,
        举镜移速: 0.348,
      },
    },
    喷火轻机枪默认: {
      战术: {
        切枪: 0.83,
        空仓换弹时间: 4.2,
      },
      移速: {
        腰射移速: 0.87,
        举镜移速: 0.348,
      },
    },
    喷火轻机枪彩弹: {
      战术: {
        切枪: 0.69,
        空仓换弹时间: 3.06,
      },
      移速: {
        腰射移速: 0.87,
        举镜移速: 0.348,
      },
    },
  },
  神射手: {
    G7侦查枪默认: {
      战术: {
        切枪: 0.71,
        空仓换弹时间: 3,
      },
      移速: {
        腰射移速: 0.87,
        举镜移速: 0.37,
      },
    },
    G7侦查枪金枪托: {
      战术: {
        切枪: 0.71,
        空仓换弹时间: 3,
      },
      移速: {
        腰射移速: 1.0,
        举镜移速: 0.425,
      },
    },
    "三重狙击枪（空投）": {
      战术: {
        切枪: 0.71,
        空仓换弹时间: 3.4,
      },
      移速: {
        腰射移速: 0.87,
        举镜移速: 0.425,
      },
    },
    "3030连发枪默认": {
      战术: {
        切枪: 0.81,
        空仓换弹时间: 3.63,
      },
      移速: {
        腰射移速: 0.87,
        举镜移速: 0.37,
      },
    },
    "3030连发枪金枪托": {
      战术: {
        切枪: 0.81,
        空仓换弹时间: 3.63,
      },
      移速: {
        腰射移速: 1.0,
        举镜移速: 0.425,
      },
    },
  },
  狙击枪: {
    小帮手: {
      战术: {
        切枪: 0.66,
        空仓换弹时间: 2.1,
      },
      移速: {
        腰射移速: 0.87,
        举镜移速: 0.87,
      },
    },
    波塞克默认: {
      战术: {
        切枪: 0.75,
        空仓换弹时间: null,
      },
      移速: {
        腰射移速: 0.87,
        举镜移速: {
          开镜: 0.74,
          拉弓: 0.435,
        },
      },
    },
    波塞克金枪托: {
      战术: {
        切枪: 0.75,
        空仓换弹时间: null,
      },
      移速: {
        腰射移速: 1.0,
        举镜移速: {
          开镜: 0.85,
          拉弓: 0.5,
        },
      },
    },
    长弓默认: {
      战术: {
        切枪: 0.78,
        空仓换弹时间: 3.66,
      },
      移速: {
        腰射移速: 0.87,
        举镜移速: 0.304,
      },
    },
    长弓金枪托: {
      战术: {
        切枪: 0.78,
        空仓换弹时间: 3.66,
      },
      移速: {
        腰射移速: 1.0,
        举镜移速: 0.35,
      },
    },
    哨兵狙击枪默认: {
      战术: {
        切枪: 0.78,
        空仓换弹时间: 3.6,
      },
      移速: {
        腰射移速: 0.87,
        举镜移速: 0.304,
      },
    },
    哨兵狙击枪金枪托: {
      战术: {
        切枪: 0.78,
        空仓换弹时间: 3.6,
      },
      移速: {
        腰射移速: 1.0,
        举镜移速: 0.35,
      },
    },
    充能步枪默认: {
      战术: {
        切枪: 0.85,
        空仓换弹时间: 4.6,
      },
      移速: {
        腰射移速: 0.87,
        举镜移速: 0.304,
      },
    },
    充能步枪金枪托: {
      战术: {
        切枪: 0.85,
        空仓换弹时间: 4.6,
      },
      移速: {
        腰射移速: 1.0,
        举镜移速: 0.35,
      },
    },
    "克雷贝尔（空投）": {
      战术: {
        切枪: 0.98,
        空仓换弹时间: 4.1,
      },
      移速: {
        腰射移速: 0.87,
        举镜移速: 0.304,
      },
    },
  },
};

export default weapon_stats;
