const ttk_ttm = {
  "冲锋枪": {
    "猎兽冲锋枪全自动": {
      "rank": 1,
      "TTK": 0.91,
      "TTM": 1.67
    },
    "猎兽冲锋枪5连发": {
      "rank": 1,
      "TTK": 1.01,
      "TTM": 1.89
    },
    "空投 双持P2020": {
      "rank": 2,
      "TTK": 0.89,
      "TTM": 1.78
    },
    "转换者冲锋枪": {
      "rank": 3,
      "TTK": 1.10,
      "TTM": 1.70
    },
    "电能冲锋枪默认": {
      "rank": 4,
      "TTK": 0.99,
      "TTM": 1.16
    },
    "电能冲锋枪彩弹": {
      "rank": 4,
      "TTK": 0.99,
      "TTM": 1.32
    },
    "RE45": {
      "rank": 5,
      "TTK": 0.83,
      "TTM": 1.13
    },
    "C.A.R冲锋枪": {
      "rank": 6,
      "TTK": 0.90,
      "TTM": 0.84
    },
    "R-99": {
      "rank": 7,
      "TTK": 0.85,
      "TTM": 0.62
    },
    "P2020（单持）": {
      "rank": 8,
      "TTK": 1.00,
      "TTM": 0.43
    }
  },
  "步枪": {
    "赫姆洛克三连发": {
      "rank": 1,
      "TTK": 1.14,
      "TTM": 2.44
    },
    "赫姆洛克单发": {
      "rank": 1,
      "TTK": 1.43,
      "TTM": 3.18
    },
    "平行步枪": {
      "rank": 2,
      "TTK": 0.99,
      "TTM": 1.78
    },
    "哈沃克": {
      "rank": 3,
      "TTK": 0.83,
      "TTM": 1.75
    },
    "复仇女神预热4枪（MAX）": {
      "rank": 4,
      "TTK": 0.87,
      "TTM": 1.39
    },
    "复仇女神冷启动": {
      "rank": 4,
      "TTK": 1.08,
      "TTM": 1.92
    },
    "R-301": {
      "rank": 5,
      "TTK": 1.04,
      "TTM": 1.19
    }
  },
  "机枪": {
    "兰伯特大招": {
      "rank": 1,
      "TTK": 0.73,
      "TTM": 8.24
    },
    "暴走轻机枪充能": {
      "rank": 2,
      "TTK": 0.92,
      "TTM": 5.06
    },
    "暴走轻机枪普通": {
      "rank": 2,
      "TTK": 1.20,
      "TTM": 6.60
    },
    "喷火轻机枪默认": {
      "rank": 3,
      "TTK": 1.00,
      "TTM": 4.44
    },
    "喷火轻机枪彩弹": {
      "rank": 3,
      "TTK": 1.00,
      "TTM": 4.67
    },
    "L-star": {
      "rank": 4,
      "TTK": 1.00,
      "TTM": 1.70
    },
    "专注轻机枪普通": {
      "rank": 5,
      "TTK": 1.33,
      "TTM": 1.48
    },
    "专注轻机枪涡轮": {
      "rank": 5,
      "TTK": 1.07,
      "TTM": 1.46
    }
  },
  "霰弹枪": {
    "和平捍卫者(进空投）紫枪栓": {
      "rank": 1,
      "TTK": 1.02,
      "TTM": 3.06
    },
    "莫桑比克（双持）紫枪栓": {
      "rank": 2,
      "TTK": 0.86,
      "TTM": 1.72
    },
    "獒犬默认紫枪栓": { // 名称更新
      "rank": 3,
      "TTK": 1.52,
      "TTM": 1.52
    },
    "獒犬彩弹紫枪栓": { // 新增
      "rank": 3,
      "TTK": 1.41,
      "TTM": 2.12
    },
    "EVA-8默认紫枪栓": {
      "rank": 4,
      "TTK": 0.93,
      "TTM": 1.24
    },
    "EVA-8彩弹紫枪栓": {
      "rank": 4,
      "TTK": 0.93,
      "TTM": 1.55
    },
    "莫桑比克（单持）紫枪栓": {
      "rank": 5,
      "TTK": 0.95,
      "TTM": 0.32
    }
  },
  "神射手": {
    "波赛克充能手雷": { // 数据更新
      "rank": 1,
      "TTK": 1.52,
      "TTM": 28.12
    },
    "波赛克未充手雷": { // 数据更新
      "rank": 1,
      "TTK": 2.28,
      "TTM": 27.36
    },
    "三重狙击枪不蓄力": {
      "rank": 2,
      "TTK": 1.15,
      "TTM": 5.18
    },
    "G7侦查枪": {
      "rank": 3,
      "TTK": 1.23,
      "TTM": 3.44
    },
    "3030连发枪首发满蓄力": {
      "rank": 4,
      "TTK": 1.72,
      "TTM": 2.15
    },
    "3030连发枪普通": {
      "rank": 4,
      "TTK": 1.72,
      "TTM": 2.15
    }
  },
  "狙击枪": {
    "长弓": {
      "rank": 1,
      "TTK": 2.30,
      "TTM": 6.13
    },
    "哨兵狙击枪充电": {
      "rank": 2,
      "TTK": 2.90,
      "TTM": 5.80
    },
    "哨兵狙击枪普通": {
      "rank": 2,
      "TTK": 3.21,
      "TTM": 6.42
    },
    "克雷贝尔（空投）": {
      "rank": 3,
      "TTK": 2.15,
      "TTM": 4.30
    },
    "万蒂奇大招": {
      "rank": 4,
      "TTK": 2.62,
      "TTM": 3.93
    },
    "充能步枪（200m）连发（计算首发蓄力）": { // 数据更新
      "rank": 5,
      "TTK": 2.55,
      "TTM": 3.19
    },
    "充能步枪（200m）普通": { // 数据更新
      "rank": 5,
      "TTK": 2.47,
      "TTM": 8.65
    },
    "充能步枪（50m）连发（计算首发蓄力）": { // 数据更新
      "rank": 6,
      "TTK": 3.31,
      "TTM": 2.65
    },
    "充能步枪（50m）普通": { // 数据更新
      "rank": 6,
      "TTK": 4.10,
      "TTM": 8.20
    },
    "小帮手": { // 数据更新
      "rank": 7,
      "TTK": 1.08,
      "TTM": 1.44
    }
  }
};

export default ttk_ttm;